jeremypoulter/ESP32_WiFi_V4.x/src/web_server.h
#ifndef _EMONESP_WEB_SERVER_H
#define _EMONESP_WEB_SERVER_H

#include <Arduino.h>
#ifdef ESP32
#include <WiFi.h>
#include <AsyncTCP.h>
#elif defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESPAsyncTCP.h>
#endif
#include <ESPAsyncWebServer.h>
#include <ArduinoJson.h>

// Content Types
extern const char _CONTENT_TYPE_HTML[];
#define CONTENT_TYPE_HTML FPSTR(_CONTENT_TYPE_HTML)

extern const char _CONTENT_TYPE_TEXT[];
#define CONTENT_TYPE_TEXT FPSTR(_CONTENT_TYPE_TEXT)

extern const char _CONTENT_TYPE_CSS[];
#define CONTENT_TYPE_CSS FPSTR(_CONTENT_TYPE_CSS)

extern const char _CONTENT_TYPE_JSON[];
#define CONTENT_TYPE_JSON FPSTR(_CONTENT_TYPE_JSON)

extern const char _CONTENT_TYPE_JS[];
#define CONTENT_TYPE_JS FPSTR(_CONTENT_TYPE_JS)

extern const char _CONTENT_TYPE_JPEG[];
#define CONTENT_TYPE_JPEG FPSTR(_CONTENT_TYPE_JPEG)

extern const char _CONTENT_TYPE_PNG[];
#define CONTENT_TYPE_PNG FPSTR(_CONTENT_TYPE_PNG)

extern const char _CONTENT_TYPE_SVG[];
#define CONTENT_TYPE_SVG FPSTR(_CONTENT_TYPE_SVG)

extern AsyncWebServer server;

extern void web_server_setup();
extern void web_server_loop();

extern void web_server_event(JsonDocument &event);

typedef const __FlashStringHelper *fstr_t;

bool requestPreProcess(AsyncWebServerRequest *request, AsyncResponseStream *&response, fstr_t contentType = CONTENT_TYPE_JSON);
void dumpRequest(AsyncWebServerRequest *request);

#endif // _EMONESP_WEB_SERVER_H
